blog/generalized-snarf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-19 Sun 10:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Generalize Snarf Tool: How The General Can Be Simpler Than The Specific</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Generalize Snarf Tool: How The General Can Be Simpler Than The Specific</h1>
<div id="outline-container-org4d4e143" class="outline-2">
<h2 id="org4d4e143"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
The
<a href="https://emacspeak.blogspot.com/2021/09/snarfing-string-within-delimiters-with.html">previous article</a> detailed the implementation of a simple function
that lets you snarf the contents within a pair of delimiters. That
version handled a set of generic delimiters, and errored out if
point was not on one of the pre-defined delimiters.
</p>

<p>
This article shows how that solution can be generalized
to cases where point is not on a pre-defined delimiter; in the
process, it weighs the pros and cons of usability vs over-generality
and shows an implementation that attempts to strike a good balance.
</p>
</div>
</div>


<div id="outline-container-org11a0752" class="outline-2">
<h2 id="org11a0752"><span class="section-number-2">2</span> The Updated Implementation</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">snarf-sexp</span> (<span style="color: #6ae4b9;">&amp;optional</span> delete)
  <span style="color: #b0d6f5;">"Snarf the contents between delimiters at point.</span>
<span style="color: #b0d6f5;">Optional interactive prefix arg deletes it."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  (<span style="color: #b6a0ff;">let</span> ((orig (point))
        (pair nil)
        (pairs <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">We keep predefined pairs for usability:</span>
         '((?&lt; ?&gt;)
           (?\[ ?\])
           (?\( ?\))
           (?{ ?})
           (?\" ?\")
           (?' ?')
           (?` ?')
           (?| ?|)
           (?* ?*)
           (?/ ?/)
           (?- ?-)
           (?_ ?_)
           (?~ ?~)))
        (char (char-after))
        (stab nil))
    (<span style="color: #b6a0ff;">setq</span> pair <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">But we read a close delimiter  for the general case</span>
          (<span style="color: #b6a0ff;">or</span> (assq char pairs) <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Predefined delimiter</span>
              (list char (read-char <span style="color: #79a8ff;">"Close Delimiter: "</span>)))) <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Generality!</span>
    (<span style="color: #b6a0ff;">setq</span> stab (copy-syntax-table))
    (<span style="color: #b6a0ff;">with-syntax-table</span> stab
      (<span style="color: #b6a0ff;">cond</span>
       ((= (cl-first pair) (cl-second pair))
        (modify-syntax-entry (cl-first pair) <span style="color: #79a8ff;">"\""</span> ) 
        (modify-syntax-entry (cl-second pair) <span style="color: #79a8ff;">"\""</span> ))
       (t
        (modify-syntax-entry (cl-first pair) <span style="color: #79a8ff;">"("</span>)
        (modify-syntax-entry (cl-second pair) <span style="color: #79a8ff;">")"</span>)))
      (<span style="color: #b6a0ff;">save-excursion</span>
        (forward-sexp)
        (<span style="color: #b6a0ff;">cond</span>
         (delete
          (kill-region (1+ orig) (1- (point))))
         (t (kill-ring-save (1+ orig) (1- (point)))))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org467ac84" class="outline-2">
<h2 id="org467ac84"><span class="section-number-2">3</span> Key Takeaways</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The generalized implementation no longer throws an error if point
is not on a pre-defined delimiter.</li>
<li>Instead, it generalizes the implementation to read the close
delimiter from the keyboard if char at point is not in the
pre-defined list.</li>
<li>We could generalize further by entirely dropping the pre-defined
delimiters, but that would hurt usability in the common case where the user would always  have to specify the close delimiter.</li>
<li>Note that usability here is not merely to reduce a keystroke;
it's more to reduce the cognitive load on the user with respect
to having to <i>think</i> about the close delimiter in the common
case.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-09-19 Sun 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2021-09-19 Sun 10:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
